src/integ-test/bdd-test/resources/xml/activatePaymentNoticeBody_full.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<nod:activatePaymentNoticeReq>
			<idPSP>$idPSP</idPSP>
			<idBrokerPSP>$idBrokerPSP</idBrokerPSP>
			<idChannel>$idChannel</idChannel>
			<password>$password</password>
			<idempotencyKey>#idempotency_key#</idempotencyKey>
			<qrCode>
				<fiscalCode>$fiscalCode</fiscalCode>
				<noticeNumber>$noticeNumber</noticeNumber>
			</qrCode>
			<amount>$amount</amount>
			<!--Optional:-->
			<dueDate>2021-12-31</dueDate>
			<!--Optional:-->
			<paymentNote>responseFull</paymentNote>
		</nod:activatePaymentNoticeReq>
	</soapenv:Body>
</soapenv:Envelope>

	
	
	